/*
#############################################################################################
# Forge War (1.0.9953.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: ForgeGame_f_structs.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Function Structs
# ========================================================================================= #
*/

// Function ForgeGame.DVGameViewportClient.GetSystemTextureGroupSetting
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UDVGameViewportClient_execGetSystemTextureGroupSetting_Parms
{
	unsigned char                                      TextureGroup;                                     		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                OutMinLODSize;                                    		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                OutMaxLODSize;                                    		// 0x0008 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	int                                                OutLODBias;                                       		// 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FName                                       OutMinMagFilter;                                  		// 0x0010 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	struct FName                                       OutMipFilter;                                     		// 0x0018 (0x0008) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned char                                      OutMipGenSettings;                                		// 0x0020 (0x0001) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function ForgeGame.DVGameViewportClient.GetSystemFloatSetting
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UDVGameViewportClient_execGetSystemFloatSetting_Parms
{
	struct FString                                     SystemSettingName;                                		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	float                                              OutVal;                                           		// 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVGameViewportClient.GetSystemIntSetting
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UDVGameViewportClient_execGetSystemIntSetting_Parms
{
	struct FString                                     SystemSettingName;                                		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                OutVal;                                           		// 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVGameViewportClient.GetSystemBoolSetting
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UDVGameViewportClient_execGetSystemBoolSetting_Parms
{
	struct FString                                     SystemSettingName;                                		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      OutVal;                                           		// 0x000C (0x0001) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0010 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVGameViewportClient.GetAvailableResolutions
// [0x00422401] ( FUNC_Final | FUNC_Native )
struct UDVGameViewportClient_execGetAvailableResolutions_Parms
{
	TArray< struct FVector >                           out_AvailableResolutions;                         		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
};

// Function ForgeGame.DVPawnBase.OnSetPawnBlockingChannels
// [0x00020002] 
struct ADVPawnBase_execOnSetPawnBlockingChannels_Parms
{
	class UDVSeqAct_SetPawnBlockingChannels*           SeqAct;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVPlayerControllerBase.GetTerminalIPAddress
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct ADVPlayerControllerBase_execGetTerminalIPAddress_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.DVPlayerControllerBase.SetHasPlayedIntro
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct ADVPlayerControllerBase_execSetHasPlayedIntro_Parms
{
	unsigned long                                      NewHasPlayedIntro : 1;                            		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function ForgeGame.DVPlayerControllerBase.GetHasPlayedIntro
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct ADVPlayerControllerBase_execGetHasPlayedIntro_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVPlayerControllerBase.SetUserId
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct ADVPlayerControllerBase_execSetUserId_Parms
{
	struct FString                                     UserId;                                           		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function ForgeGame.DVPlayerControllerBase.GetUserId
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct ADVPlayerControllerBase_execGetUserId_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.DVPlayerControllerBase.SetSessionId
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct ADVPlayerControllerBase_execSetSessionId_Parms
{
	struct FString                                     SessionId;                                        		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
};

// Function ForgeGame.DVPlayerControllerBase.GetSessionID
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct ADVPlayerControllerBase_execGetSessionID_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.ForgeGameInfoBase.GetAuthenticatedServerSessionKey
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct AForgeGameInfoBase_execGetAuthenticatedServerSessionKey_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.ForgeGameInfoBase.GetAuthenticatedServerId
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct AForgeGameInfoBase_execGetAuthenticatedServerId_Parms
{
	int                                                ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeGameInfoBase.DoesMapExist
// [0x00022401] ( FUNC_Final | FUNC_Native )
struct AForgeGameInfoBase_execDoesMapExist_Parms
{
	struct FString                                     MapName;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned long                                      ReturnValue : 1;                                  		// 0x000C (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeDB.ConvertSteamRegionIdToGameTagFilterText
// [0x00022002] 
struct UForgeDB_execConvertSteamRegionIdToGameTagFilterText_Parms
{
	int                                                SteamRegionId;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.ForgeDB.ConvertSteamRegionIdToForgeRegionId
// [0x00022002] 
struct UForgeDB_execConvertSteamRegionIdToForgeRegionId_Parms
{
	int                                                SteamRegionId;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeDB.ConvertForgeRegionIdToSteamRegionId
// [0x00022002] 
struct UForgeDB_execConvertForgeRegionIdToSteamRegionId_Parms
{
	int                                                ForgeRegionId;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeDB.GetAbilitySlotOrderProfileSettingsIndex
// [0x00026002] 
struct UForgeDB_execGetAbilitySlotOrderProfileSettingsIndex_Parms
{
	unsigned char                                      PlayerClass;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                SlotIndex;                                        		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeDB.GetAbilityFocusProfileSettingsIndex
// [0x00022002] 
struct UForgeDB_execGetAbilityFocusProfileSettingsIndex_Parms
{
	unsigned char                                      PlayerClass;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeDB.GetEnglishKeyName
// [0x00022002] 
struct UForgeDB_execGetEnglishKeyName_Parms
{
	struct FName                                       OldKeyName;                                       		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// int                                             Counter;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FString                                  NewKeyName;                                       		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function ForgeGame.ForgeDB.GetKeyForFunction
// [0x00022002] 
struct UForgeDB_execGetKeyForFunction_Parms
{
	struct FString                                     BoundCommand;                                     		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FName                                       ReturnValue;                                      		// 0x000C (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UPlayerInput*                             ThePlayerInput;                                   		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             Counter;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
	// unsigned long                                   BindFound : 1;                                    		// 0x001C (0x0004) [0x0000000000000000] [0x00000001] 
};

// Function ForgeGame.ForgeDB.GetOrderMappedAbilityIndex
// [0x00026002] 
struct UForgeDB_execGetOrderMappedAbilityIndex_Parms
{
	int                                                DefaultAbilityIndex;                              		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      ChosenClass;                                      		// 0x0004 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned char                                   FinalChosenClass;                                 		// 0x000C (0x0001) [0x0000000000000000]              
	// class ADVPlayerController*                      TheDVPC;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             CurSettingIndex;                                  		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FString                                  CurSettingValue;                                  		// 0x0018 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function ForgeGame.ForgeDB.MouseIsOverElement
// [0x00822002] 
struct UForgeDB_execMouseIsOverElement_Parms
{
	class UGFxObject*                                  TheElement;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector2D                                MouseFlashPosition;                               		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FASValue                                 HitResult;                                        		// 0x0010 (0x001C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// TArray< struct FASValue >                       HitParams;                                        		// 0x002C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function ForgeGame.ForgeDB.GetMouseFlashPosition
// [0x00822002] 
struct UForgeDB_execGetMouseFlashPosition_Parms
{
	struct FVector2D                                   ReturnValue;                                      		// 0x0000 (0x0008) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// struct FVector2D                                MouseScreenPosition;                              		// 0x0008 (0x0008) [0x0000000000000000]              
	// struct FVector2D                                MouseFlashPosition;                               		// 0x0010 (0x0008) [0x0000000000000000]              
	// struct FVector2D                                ViewportSize;                                     		// 0x0018 (0x0008) [0x0000000000000000]              
	// int                                             TotalVisiblePixels;                               		// 0x0020 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.ForgeDB.GetSkinNameFromEnum
// [0x00022002] 
struct UForgeDB_execGetSkinNameFromEnum_Parms
{
	unsigned char                                      TheSkinEnum;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.ForgeDB.GetSkinEnumFromId
// [0x00022002] 
struct UForgeDB_execGetSkinEnumFromId_Parms
{
	int                                                SkinId;                                           		// 0x0000 (0x0004) [0x0000000000000880]              ( CPF_Parm | CPF_CoerceParm )
	unsigned char                                      ReturnValue;                                      		// 0x0004 (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// unsigned char                                   TheSkinEnum;                                      		// 0x0005 (0x0001) [0x0000000000000000]              
};

// Function ForgeGame.ForgeDB.GetAbilitySlotTextureForClass
// [0x00022002] 
struct UForgeDB_execGetAbilitySlotTextureForClass_Parms
{
	unsigned char                                      TheClass;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                AbilitySlot;                                      		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UTexture*                                    ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UObject*                                  FoundTexture;                                     		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.ForgeDB.GetAbilitySlotNameForClass
// [0x00022002] 
struct UForgeDB_execGetAbilitySlotNameForClass_Parms
{
	unsigned char                                      TheClass;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	int                                                AbilitySlot;                                      		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// int                                             Counter;                                          		// 0x0014 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.ForgeDB.GetAbilitySlotNameForAbility
// [0x00022002] 
struct UForgeDB_execGetAbilitySlotNameForAbility_Parms
{
	class ADVAbility*                                  InputAbility;                                     		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.ForgeDB.UsesMana
// [0x00022002] 
struct UForgeDB_execUsesMana_Parms
{
	unsigned char                                      TheClass;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeDB.GetClassClassFromEnum
// [0x00022002] 
struct UForgeDB_execGetClassClassFromEnum_Parms
{
	unsigned char                                      ThePlayerClass;                                   		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeDB.GetClassStringFromEnum
// [0x00022002] 
struct UForgeDB_execGetClassStringFromEnum_Parms
{
	unsigned char                                      ThePlayerClass;                                   		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0004 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.ForgeDB.GetClassEnumFromString
// [0x00022002] 
struct UForgeDB_execGetClassEnumFromString_Parms
{
	struct FString                                     ClassName;                                        		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      ReturnValue;                                      		// 0x000C (0x0001) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeDB.GetAbilityArchetype
// [0x00026002] 
struct UForgeDB_execGetAbilityArchetype_Parms
{
	unsigned char                                      OwningClass;                                      		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Slot;                                             		// 0x0001 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      Focus;                                            		// 0x0002 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	class ADVAbility*                                  ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             Counter;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.ForgeDB.GetPawnArchetypeForClass
// [0x00022002] 
struct UForgeDB_execGetPawnArchetypeForClass_Parms
{
	unsigned char                                      TheClass;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	class ADVPawnHero*                                 ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.ForgeDB.GetMapId
// [0x00022002] 
struct UForgeDB_execGetMapId_Parms
{
	struct FString                                     MapName;                                          		// 0x0000 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             MapIndex;                                         		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.ForgeDB.GetGameTypeId
// [0x00022002] 
struct UForgeDB_execGetGameTypeId_Parms
{
	struct FString                                     GameType;                                         		// 0x0000 (0x000C) [0x0000000000400880]              ( CPF_Parm | CPF_CoerceParm | CPF_NeedCtorLink )
	int                                                ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             GameTypeIndex;                                    		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.ForgeDB.GetSteamId
// [0x00022002] 
struct UForgeDB_execGetSteamId_Parms
{
	struct FUniqueNetId                                UniqueId;                                         		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// int                                             Y;                                                		// 0x0014 (0x0004) [0x0000000000000000]              
	// int                                             Z;                                                		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.ResetForRoundStart
// [0x00020002] 
struct UDVBuffCalculator_execResetForRoundStart_Parms
{
	// int                                             Counter;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.ResetForDeath
// [0x00020002] 
struct UDVBuffCalculator_execResetForDeath_Parms
{
	// int                                             Counter;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.RemoveExpired
// [0x00020002] 
struct UDVBuffCalculator_execRemoveExpired_Parms
{
	// int                                             Counter;                                          		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.CalculateFinalCaps
// [0x00480002] 
struct UDVBuffCalculator_execCalculateFinalCaps_Parms
{
	unsigned char                                      StatName;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              PreviousValue;                                    		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function ForgeGame.DVBuffCalculator.CalculatePreLockCaps
// [0x00480002] 
struct UDVBuffCalculator_execCalculatePreLockCaps_Parms
{
	unsigned char                                      StatName;                                         		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              PreviousValue;                                    		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
};

// Function ForgeGame.DVBuffCalculator.CalculateMaxChanges
// [0x00080002] 
struct UDVBuffCalculator_execCalculateMaxChanges_Parms
{
	unsigned char                                      TheStat;                                          		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              EffectiveValue;                                   		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              BaseValue;                                        		// 0x0008 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x000C (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// int                                             Counter;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.CalculateAssignedChanges
// [0x00C80002] 
struct UDVBuffCalculator_execCalculateAssignedChanges_Parms
{
	unsigned char                                      TheStat;                                          		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              PreviousValue;                                    		// 0x0004 (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	// int                                             Counter;                                          		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FProtectionFromAbility                   PFA;                                              		// 0x000C (0x0008) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.CalculateAddedChanges
// [0x00880002] 
struct UDVBuffCalculator_execCalculateAddedChanges_Parms
{
	unsigned char                                      TheStat;                                          		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0004 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           TotalModification;                                		// 0x0008 (0x0004) [0x0000000000000000]              
	// int                                             Counter;                                          		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             IndexFound;                                       		// 0x0010 (0x0004) [0x0000000000000000]              
	// struct FProtectionFromAbility                   PFA;                                              		// 0x0014 (0x0008) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.CalculateMultipliedChanges
// [0x00880002] 
struct UDVBuffCalculator_execCalculateMultipliedChanges_Parms
{
	unsigned char                                      TheStat;                                          		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              BaseValue;                                        		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           TotalModification;                                		// 0x000C (0x0004) [0x0000000000000000]              
	// int                                             Counter;                                          		// 0x0010 (0x0004) [0x0000000000000000]              
	// int                                             IndexFound;                                       		// 0x0014 (0x0004) [0x0000000000000000]              
	// struct FProtectionFromAbility                   PFA;                                              		// 0x0018 (0x0008) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.CalculateStat
// [0x00024002] 
struct UDVBuffCalculator_execCalculateStat_Parms
{
	unsigned char                                      TheStat;                                          		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	float                                              BaseValue;                                        		// 0x0004 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           EffectiveValue;                                   		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.AddBuff
// [0x00820002] 
struct UDVBuffCalculator_execAddBuff_Parms
{
	class UDVBuff*                                     NewBuff;                                          		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FSStatChange                             CurStatChange;                                    		// 0x0004 (0x0018) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.AddToStatChanges
// [0x00020002] 
struct UDVBuffCalculator_execAddToStatChanges_Parms
{
	struct FSStatChange                                NewStatChange;                                    		// 0x0000 (0x0018) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Counter;                                          		// 0x0018 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVBuffCalculator.Destroyed
// [0x00020002] 
struct UDVBuffCalculator_execDestroyed_Parms
{
};

// Function ForgeGame.DVAbility.Destroyed
// [0x00020902] ( FUNC_Event )
struct ADVAbility_eventDestroyed_Parms
{
};

// Function ForgeGame.DVAbility.GetDescriptionNumbers
// [0x00022002] 
struct ADVAbility_execGetDescriptionNumbers_Parms
{
	class ADVAbility*                                  AbilityArchetype;                                 		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      TheClass;                                         		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     StaticFriendlyColor;                              		// 0x0008 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     StaticEnemyColor;                                 		// 0x0014 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	struct FString                                     ReturnValue;                                      		// 0x0020 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// struct FString                                  OutputString;                                     		// 0x002C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function ForgeGame.DVAbility.GetFullDescription
// [0x00022002] 
struct ADVAbility_execGetFullDescription_Parms
{
	class ADVAbility*                                  AbilityArchetype;                                 		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned char                                      TheClass;                                         		// 0x0004 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0008 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// struct FString                                  AbilityLocalizationPath;                          		// 0x0014 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FString                                  OutputString;                                     		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FString                                  StaticFriendlyColor;                              		// 0x002C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	// struct FString                                  StaticEnemyColor;                                 		// 0x0038 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function ForgeGame.DVAbility.KillPartcleEmitter
// [0x00020102] 
struct ADVAbility_execKillPartcleEmitter_Parms
{
};

// Function ForgeGame.DVAbility.AddParticleEmitter
// [0x00020102] 
struct ADVAbility_execAddParticleEmitter_Parms
{
	class APawn*                                       Hero;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVAbility.MakeAttack
// [0x00020002] 
struct ADVAbility_execMakeAttack_Parms
{
	class UDVAttack*                                   ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UDVAttack*                                NewAttack;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.SpawnAttack
// [0x00020002] 
struct ADVAbility_execSpawnAttack_Parms
{
	class UDVAttack*                                   ReturnValue;                                      		// 0x0000 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class UDVAttack*                                NewAttack;                                        		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.HotTick
// [0x00040003] ( FUNC_Final )
struct ADVAbility_execHotTick_Parms
{
	// class UDVHealthOverTime*                        Hot;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.SendHot
// [0x00020002] 
struct ADVAbility_execSendHot_Parms
{
	class ADVPawn*                                     HotTarget;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UDVHealthOverTime*                        Hot;                                              		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.Reset
// [0x00020002] 
struct ADVAbility_execReset_Parms
{
	// class UDVHealthOverTime*                        Hot;                                              		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.UnRegisterWithAllDefendingPawns
// [0x00020002] 
struct ADVAbility_execUnRegisterWithAllDefendingPawns_Parms
{
};

// Function ForgeGame.DVAbility.UnRegisterWithDefendingPawn
// [0x00020002] 
struct ADVAbility_execUnRegisterWithDefendingPawn_Parms
{
	class ADVPawn*                                     Modifier;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Counter;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.RegisterWithDefendingPawn
// [0x00020002] 
struct ADVAbility_execRegisterWithDefendingPawn_Parms
{
	class ADVPawn*                                     Modifier;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVAbility.ModifyDefense
// [0x00420000] 
struct ADVAbility_execModifyDefense_Parms
{
	TArray< struct FSDamage >                          DamageTaken;                                      		// 0x0000 (0x000C) [0x0000000000400180]              ( CPF_Parm | CPF_OutParm | CPF_NeedCtorLink )
	int                                                ProtectionDone;                                   		// 0x000C (0x0004) [0x0000000000000180]              ( CPF_Parm | CPF_OutParm )
	class UDVAttack*                                   IncomingAttack;                                   		// 0x0010 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class ADVPawn*                                     Defender;                                         		// 0x0014 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVAbility.UnRegisterWithAllAttackingPawns
// [0x00020002] 
struct ADVAbility_execUnRegisterWithAllAttackingPawns_Parms
{
};

// Function ForgeGame.DVAbility.UnRegisterWithAttackingPawn
// [0x00020002] 
struct ADVAbility_execUnRegisterWithAttackingPawn_Parms
{
	class ADVPawn*                                     Modifier;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// int                                             Counter;                                          		// 0x0004 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.RegisterWithAttackingPawn
// [0x00020002] 
struct ADVAbility_execRegisterWithAttackingPawn_Parms
{
	class ADVPawn*                                     Modifier;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVAbility.ModifyAttack
// [0x00020000] 
struct ADVAbility_execModifyAttack_Parms
{
	class UDVAttack*                                   OutGoingAttack;                                   		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVAbility.IsStillInLOS
// [0x00880002] 
struct ADVAbility_execIsStillInLOS_Parms
{
	class ADVPawn*                                     TargetActor;                                      		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class AActor*                                   CurActor;                                         		// 0x0008 (0x0004) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0018 (0x000C) [0x0000000000000000]              
	// class ADVPawn*                                  InstigatorDVPawn;                                 		// 0x0024 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.GoOnCooldown
// [0x00020002] 
struct ADVAbility_execGoOnCooldown_Parms
{
	unsigned long                                      UseResource : 1;                                  		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
};

// Function ForgeGame.DVAbility.Interrupt
// [0x00020002] 
struct ADVAbility_execInterrupt_Parms
{
	unsigned long                                      SelfInterrupt : 1;                                		// 0x0000 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0004 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVAbility.LogStartCast
// [0x00040003] ( FUNC_Final )
struct ADVAbility_execLogStartCast_Parms
{
	// class UDVLogEntry*                              LogEntry;                                         		// 0x0000 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.FireAbility
// [0x00080000] 
struct ADVAbility_execFireAbility_Parms
{
};

// Function ForgeGame.DVAbility.PerformAbility
// [0x00080002] 
struct ADVAbility_execPerformAbility_Parms
{
};

// Function ForgeGame.DVAbility.Activate
// [0x00024103] ( FUNC_Final )
struct ADVAbility_execActivate_Parms
{
	class ADVPawn*                                     RepTargetPawn;                                    		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      RepUsingAimAssist : 1;                            		// 0x0004 (0x0004) [0x0000000000000090] [0x00000001] ( CPF_OptionalParm | CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0008 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVAbility.ReadyToActivate
// [0x00020102] 
struct ADVAbility_execReadyToActivate_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVAbility.IsAbilityReady
// [0x00020102] 
struct ADVAbility_execIsAbilityReady_Parms
{
	unsigned long                                      ReturnValue : 1;                                  		// 0x0000 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVAbility.Tick
// [0x00020102] 
struct ADVAbility_execTick_Parms
{
	float                                              DeltaTime;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVAbility.SetAbilitiesIndex
// [0x00020002] 
struct ADVAbility_execSetAbilitiesIndex_Parms
{
	int                                                NewAbilitiesIndex;                                		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVAbility.PlayFailureEffect
// [0x00020102] 
struct ADVAbility_execPlayFailureEffect_Parms
{
	// class UParticleSystemComponent*                 FailEmitter;                                      		// 0x0000 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function ForgeGame.DVAbility.PlayHitEffect
// [0x00020102] 
struct ADVAbility_execPlayHitEffect_Parms
{
	class ADVPawn*                                     RepHitPawn;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UParticleSystemComponent*                 HitEmitter;                                       		// 0x0004 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function ForgeGame.DVAbility.PlayFireEffect
// [0x00020102] 
struct ADVAbility_execPlayFireEffect_Parms
{
	class ADVPawn*                                     RepHitPawn;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// class UParticleSystemComponent*                 FireEmitter;                                      		// 0x0004 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
};

// Function ForgeGame.DVAbility.PlayAnim
// [0x00020102] 
struct ADVAbility_execPlayAnim_Parms
{
};

// Function ForgeGame.DVAbility.PlayCastEffect
// [0x00020102] 
struct ADVAbility_execPlayCastEffect_Parms
{
	// int                                             I;                                                		// 0x0000 (0x0004) [0x0000000000000000]              
	// class UParticleSystemComponent*                 CastingEmitter;                                   		// 0x0004 (0x0004) [0x0000000004000000]              ( CPF_EditInline )
	// class ADVSkeletalMeshAttachment*                DVSkeletalMeshAttachment;                         		// 0x0008 (0x0004) [0x0000000000000000]              
	// class ADVPlayerController*                      PC;                                               		// 0x000C (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVAbility.GetAbilityDescription
// [0x00020002] 
struct ADVAbility_execGetAbilityDescription_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.DVAbility.GetAbilityName
// [0x00020002] 
struct ADVAbility_execGetAbilityName_Parms
{
	struct FString                                     ReturnValue;                                      		// 0x0000 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
};

// Function ForgeGame.DVAbility.GetAbilityLocalizationPath
// [0x00026002] 
struct ADVAbility_execGetAbilityLocalizationPath_Parms
{
	unsigned char                                      TheOwningClass;                                   		// 0x0000 (0x0001) [0x0000000000000080]              ( CPF_Parm )
	struct FString                                     TheAbilityName;                                   		// 0x0004 (0x000C) [0x0000000000400080]              ( CPF_Parm | CPF_NeedCtorLink )
	unsigned char                                      TheFocus;                                         		// 0x0010 (0x0001) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
	struct FString                                     ReturnValue;                                      		// 0x0014 (0x000C) [0x0000000000400580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm | CPF_NeedCtorLink )
	// struct FString                                  LocalizationPath;                                 		// 0x0020 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
};

// Function ForgeGame.DVAbility.ReplicatedEvent
// [0x00020902] ( FUNC_Event )
struct ADVAbility_eventReplicatedEvent_Parms
{
	struct FName                                       VarName;                                          		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVPawn.BaseChange
// [0x00820822] ( FUNC_Event )
struct ADVPawn_eventBaseChange_Parms
{
	// struct FVector                                  TempVect;                                         		// 0x0000 (0x000C) [0x0000000000000000]              
};

// Function ForgeGame.DVPawn.TossPawn
// [0x00020000] 
struct ADVPawn_execTossPawn_Parms
{
	struct FVector                                     Knockback;                                        		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVPawn.PlayFootStepSound
// [0x00820902] ( FUNC_Event )
struct ADVPawn_eventPlayFootStepSound_Parms
{
	int                                                FootDown;                                         		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	// struct FName                                    SocketName;                                       		// 0x0004 (0x0008) [0x0000000000000000]              
	// struct FRotator                                 SocketRotation;                                   		// 0x000C (0x000C) [0x0000000000000000]              
	// struct FVector                                  SocketLocation;                                   		// 0x0018 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitLocation;                                      		// 0x0024 (0x000C) [0x0000000000000000]              
	// struct FVector                                  HitNormal;                                        		// 0x0030 (0x000C) [0x0000000000000000]              
	// struct FTraceHitInfo                            HitInfo;                                          		// 0x003C (0x001C) [0x0000000000000000]              
	// class UDVPhysicalMaterialProperties*            PhysicalMaterialProperties;                       		// 0x0058 (0x0004) [0x0000000000000000]              
	// int                                             Index;                                            		// 0x005C (0x0004) [0x0000000000000000]              
	// int                                             I;                                                		// 0x0060 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVPawn.AddVelocity
// [0x00024002] 
struct ADVPawn_execAddVelocity_Parms
{
	struct FVector                                     NewVelocity;                                      		// 0x0000 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x000C (0x000C) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0018 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FTraceHitInfo                               HitInfo;                                          		// 0x001C (0x001C) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function ForgeGame.DVPawn.RemoveDisoriented
// [0x00024002] 
struct ADVPawn_execRemoveDisoriented_Parms
{
	int                                                Decrease;                                         		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function ForgeGame.DVPawn.AddDisoriented
// [0x00024002] 
struct ADVPawn_execAddDisoriented_Parms
{
	int                                                Increase;                                         		// 0x0000 (0x0004) [0x0000000000000090]              ( CPF_OptionalParm | CPF_Parm )
};

// Function ForgeGame.DVPawn.TakeFallingDamage
// [0x00020002] 
struct ADVPawn_execTakeFallingDamage_Parms
{
	// float                                           EffectiveSpeed;                                   		// 0x0000 (0x0004) [0x0000000000000000]              
	// float                                           TotalDamageDone;                                  		// 0x0004 (0x0004) [0x0000000000000000]              
	// float                                           AdjustedMaxFallSpeed;                             		// 0x0008 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVPawn.GiveBuff
// [0x00020002] 
struct ADVPawn_execGiveBuff_Parms
{
	class UDVBuff*                                     GivenBuff;                                        		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
};

// Function ForgeGame.DVPawn.ArmorDiminish
// [0x00022002] 
struct ADVPawn_execArmorDiminish_Parms
{
	int                                                ArmorValue;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              Scale;                                            		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVPawn.GetArmorForType
// [0x00020002] 
struct ADVPawn_execGetArmorForType_Parms
{
	class UClass*                                      Type;                                             		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      BaseArmor : 1;                                    		// 0x0004 (0x0004) [0x0000000000000080] [0x00000001] ( CPF_Parm )
	int                                                ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
};

// Function ForgeGame.DVPawn.ReduceDamage
// [0x00820002] 
struct ADVPawn_execReduceDamage_Parms
{
	struct FSDamage                                    NewDamage;                                        		// 0x0000 (0x0008) [0x0000000000000080]              ( CPF_Parm )
	float                                              ReturnValue;                                      		// 0x0008 (0x0004) [0x0000000000000580]              ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// float                                           FinalDamage;                                      		// 0x000C (0x0004) [0x0000000000000000]              
	// float                                           DamageWithAddedArmor;                             		// 0x0010 (0x0004) [0x0000000000000000]              
	// float                                           ProtectionDone;                                   		// 0x0014 (0x0004) [0x0000000000000000]              
	// float                                           PreArmorDamage;                                   		// 0x0018 (0x0004) [0x0000000000000000]              
	// float                                           UsedArmor;                                        		// 0x001C (0x0004) [0x0000000000000000]              
	// float                                           BaseArmor;                                        		// 0x0020 (0x0004) [0x0000000000000000]              
	// float                                           BaseArmorDamage;                                  		// 0x0024 (0x0004) [0x0000000000000000]              
	// struct FProtectionFromAbility                   CurPFA;                                           		// 0x0028 (0x0008) [0x0000000000000000]              
};

// Function ForgeGame.DVPawn.StartRagdoll
// [0x00020102] 
struct ADVPawn_execStartRagdoll_Parms
{
};

// Function ForgeGame.DVPawn.StopRagdoll
// [0x00020102] 
struct ADVPawn_execStopRagdoll_Parms
{
};

// Function ForgeGame.DVPawn.SetRagdollAnimation
// [0x00020102] 
struct ADVPawn_execSetRagdollAnimation_Parms
{
};

// Function ForgeGame.DVPawn.PlayDying
// [0x00020102] 
struct ADVPawn_execPlayDying_Parms
{
	class UClass*                                      DamageType;                                       		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLoc;                                           		// 0x0004 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	// int                                             I;                                                		// 0x0010 (0x0004) [0x0000000000000000]              
};

// Function ForgeGame.DVPawn.Died
// [0x00020002] 
struct ADVPawn_execDied_Parms
{
	class AController*                                 Killer;                                           		// 0x0000 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	class UClass*                                      DamageType;                                       		// 0x0004 (0x0004) [0x0000000000000080]              ( CPF_Parm )
	struct FVector                                     HitLocation;                                      		// 0x0008 (0x000C) [0x0000000000000080]              ( CPF_Parm )
	unsigned long                                      ReturnValue : 1;                                  		// 0x0014 (0x0004) [0x0000000000000580] [0x00000001] ( CPF_Parm | CPF_OutParm | CPF_ReturnParm )
	// class ADVPlayerController*                      PC;                                               		// 0x0018 (0x0004) [0x0000000000000000]              
