/*
#############################################################################################
# Forge War (1.0.9953.0) SDK
# Generated with TheFeckless UE3 SDK Generator v1.4_Beta-Rev.51
# ========================================================================================= #
# File: ForgeGame_classes.h
# ========================================================================================= #
# Credits: uNrEaL, Tamimego, SystemFiles, R00T88, _silencer, the1domo, K@N@VEL
# Thanks: HOOAH07, lowHertz
# Forums: www.uc-forum.com, www.gamedeception.net
#############################################################################################
*/

#ifdef _MSC_VER
	#pragma pack ( push, 0x4 )
#endif

/*
# ========================================================================================= #
# Constants
# ========================================================================================= #
*/

#define CONST_JOIN_SERVER_HEADER                                 "JOIN"
#define CONST_KICK_HEADER                                        "KICK"

/*
# ========================================================================================= #
# Enums
# ========================================================================================= #
*/

// Enum ForgeGame.ForgeDB.ESkin
/*enum ESkin
{
	ES_Default                                         = 0,
	ES_Black                                           = 1,
	ES_White                                           = 2,

	NQT_GetPlayerClassCustomization                    = 16,
	NQT_SpendArmorPoint                                = 17,
	NQT_SpendCustomizationPoint                        = 18,
	NQT_AwardAchievement                               = 19,
	NQT_AuthenticateSteamPlayer                        = 20,
	NQT_EnterCode                                      = 21,
	NQT_MAX                                            = 22
};*/

// Enum ForgeGame.DVSeqAct_SetTeamSpawn.EForgeTeam
/*enum EForgeTeam
{
	EFT_Team0                                          = 0,
	EFT_Team1                                          = 1,
	EFT_TeamAll                                        = 2,
	EFT_MAX                                            = 3
};*/

// Enum ForgeGame.DVSeqAct_TutorialSectionComplete.ESectionCompleted
/*enum ESectionCompleted
{
	ESC_Movement                                       = 0,
	ESC_Block                                          = 1,
	ESC_MovementAbility                                = 2,
	ESC_AbilityRange                                   = 3,
	ESC_MAX                                            = 4
};*/

// Enum ForgeGame.DVSeqEvent_Input.EForgeInputType
/*enum EForgeInputType
{
	EFIT_Ability1                                      = 0,
	EFIT_Ability2                                      = 1,
	EFIT_Ability3                                      = 2,
	EFIT_Ability4                                      = 3,
	EFIT_Ability5                                      = 4,
	EFIT_Ability6                                      = 5,
	EFIT_Ability7                                      = 6,
	EFIT_Ability8                                      = 7,
	EFIT_Ability9                                      = 8,
	EFIT_Block                                         = 9,
	EFIT_Jump                                          = 10,
	EFIT_Sprint                                        = 11,
	EFIT_MAX                                           = 12
};*/

// Enum ForgeGame.ForgeClassRewardLevels.EXPRewardType
/*enum EXPRewardType
{
	XPRT_Armor                                         = 0,
	XPRT_Customization                                 = 1,
	XPRT_Ability                                       = 2,
	XPRT_Title                                         = 3,
	XPRT_Skin                                          = 4,
	XPRT_Emote                                         = 5,
	XPRT_MAX                                           = 6
};*/

// Enum ForgeGame.ForgeGFxHUD.ENagState
/*enum ENagState
{
	ENS_ClassSelect                                    = 0,
	ENS_Respawn                                        = 1,
	ENS_WaitingForPlayers                              = 2,
	ENS_NONE                                           = 3,
	ENS_MAX                                            = 4
};*/


/*
# ========================================================================================= #
# Classes
# ========================================================================================= #
*/

// Class ForgeGame.DVGameViewportClient
// 0x0000 (0x0128 - 0x0128)
class UDVGameViewportClient : public UGameViewportClient
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1840 ];

		return pClassPointer;
	};

	void GetSystemTextureGroupSetting ( unsigned char TextureGroup, int* OutMinLODSize, int* OutMaxLODSize, int* OutLODBias, struct FName* OutMinMagFilter, struct FName* OutMipFilter, unsigned char* OutMipGenSettings );
	bool GetSystemFloatSetting ( struct FString SystemSettingName, float* OutVal );
	bool GetSystemIntSetting ( struct FString SystemSettingName, int* OutVal );
	bool GetSystemBoolSetting ( struct FString SystemSettingName, unsigned char* OutVal );
	void GetAvailableResolutions ( TArray< struct FVector >* out_AvailableResolutions );
};

UClass* UDVGameViewportClient::pClassPointer = NULL;

// Class ForgeGame.DVPawnBase
// 0x000C (0x045C - 0x0450)
class ADVPawnBase : public APawn
{
public:
	struct FBlockingChannelsContainer                  BlockingChannels;                                 		// 0x0450 (0x0004) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
	unsigned long                                      ShadowShifted : 1;                                		// 0x0454 (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
	float                                              FrictionOverride;                                 		// 0x0458 (0x0004) [0x0000000000000020]              ( CPF_Net )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1841 ];

		return pClassPointer;
	};

	void OnSetPawnBlockingChannels ( class UDVSeqAct_SetPawnBlockingChannels* SeqAct );
};

UClass* ADVPawnBase::pClassPointer = NULL;

// Class ForgeGame.DVPlayerControllerBase
// 0x0000 (0x0584 - 0x0584)
class ADVPlayerControllerBase : public APlayerController
{
public:

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1842 ];

		return pClassPointer;
	};

	struct FString GetTerminalIPAddress ( );
	void SetHasPlayedIntro ( unsigned long NewHasPlayedIntro );
	bool GetHasPlayedIntro ( );
	void SetUserId ( struct FString UserId );
	struct FString GetUserId ( );
	void SetSessionId ( struct FString SessionId );
	struct FString GetSessionID ( );
};

UClass* ADVPlayerControllerBase::pClassPointer = NULL;

// Class ForgeGame.ForgeGameInfoBase
// 0x0024 (0x0398 - 0x0374)
class AForgeGameInfoBase : public AGameInfo
{
public:
	TArray< struct FString >                           GameTypes;                                        		// 0x0374 (0x000C) [0x0000000000444002]              ( CPF_Const | CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	TArray< struct FString >                           Maps;                                             		// 0x0380 (0x000C) [0x0000000000444002]              ( CPF_Const | CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	struct FString                                     ForgeVersion;                                     		// 0x038C (0x000C) [0x0000000000444002]              ( CPF_Const | CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1843 ];

		return pClassPointer;
	};

	struct FString GetAuthenticatedServerSessionKey ( );
	int GetAuthenticatedServerId ( );
	bool DoesMapExist ( struct FString MapName );
};

UClass* AForgeGameInfoBase::pClassPointer = NULL;

// Class ForgeGame.DVAnimNodeBlendByFall
// 0x0010 (0x0124 - 0x0114)
class UDVAnimNodeBlendByFall : public UAnimNodeBlendList
{
public:
	float                                              BlendTime;                                        		// 0x0114 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              PreLandTime;                                      		// 0x0118 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	unsigned char                                      FallState;                                        		// 0x011C (0x0001) [0x0000000000000002]              ( CPF_Const )
	float                                              LastFallingVelocity;                              		// 0x0120 (0x0004) [0x0000000000000002]              ( CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1844 ];

		return pClassPointer;
	};

};

UClass* UDVAnimNodeBlendByFall::pClassPointer = NULL;

// Class ForgeGame.DVAnimNodeScaleRateByPawnSpeed
// 0x000C (0x0104 - 0x00F8)
class UDVAnimNodeScaleRateByPawnSpeed : public UAnimNodeScalePlayRate
{
public:
	float                                              AnimationMovementSpeed;                           		// 0x00F8 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              PostMultiplier;                                   		// 0x00FC (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              PostAddition;                                     		// 0x0100 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1845 ];

		return pClassPointer;
	};

};

UClass* UDVAnimNodeScaleRateByPawnSpeed::pClassPointer = NULL;

// Class ForgeGame.DVAnimNotify_BoneVisibility
// 0x0011 (0x0051 - 0x0040)
class UDVAnimNotify_BoneVisibility : public UAnimNotify
{
public:
	TArray< struct FName >                             Bones;                                            		// 0x0040 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	unsigned long                                      bHideBones : 1;                                   		// 0x004C (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned long                                      bSkipIfOwnerIsHidden : 1;                         		// 0x004C (0x0004) [0x0000000000000003] [0x00000002] ( CPF_Edit | CPF_Const )
	unsigned char                                      PhysicsBodyOption;                                		// 0x0050 (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1846 ];

		return pClassPointer;
	};

};

UClass* UDVAnimNotify_BoneVisibility::pClassPointer = NULL;

// Class ForgeGame.DVAnimNotify_Scripted
// 0x000C (0x004C - 0x0040)
class UDVAnimNotify_Scripted : public UAnimNotify_Scripted
{
public:
	struct FString                                     Label;                                            		// 0x0040 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 1847 ];

		return pClassPointer;
	};

};

UClass* UDVAnimNotify_Scripted::pClassPointer = NULL;

// Class ForgeGame.ForgeDB
// 0x0028 (0x0064 - 0x003C)
class UForgeDB : public UObject
{
public:
	TArray< class ADVPawnHero* >                       HeroPawns;                                        		// 0x003C (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	TArray< class ADVAbility* >                        Abilities;                                        		// 0x0048 (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )
	class ADVAbility*                                  UnstuckAbilityArchetype;                          		// 0x0054 (0x0004) [0x0000000000000002]              ( CPF_Const )
	TArray< struct FName >                             BindableKeys;                                     		// 0x0058 (0x000C) [0x0000000000400002]              ( CPF_Const | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42419 ];

		return pClassPointer;
	};

	struct FString ConvertSteamRegionIdToGameTagFilterText ( int SteamRegionId );
	int ConvertSteamRegionIdToForgeRegionId ( int SteamRegionId );
	int ConvertForgeRegionIdToSteamRegionId ( int ForgeRegionId );
	int GetAbilitySlotOrderProfileSettingsIndex ( unsigned char PlayerClass, int SlotIndex );
	int GetAbilityFocusProfileSettingsIndex ( unsigned char PlayerClass );
	struct FString GetEnglishKeyName ( struct FName OldKeyName );
	struct FName GetKeyForFunction ( struct FString BoundCommand );
	int GetOrderMappedAbilityIndex ( int DefaultAbilityIndex, unsigned char ChosenClass );
	bool MouseIsOverElement ( class UGFxObject* TheElement );
	struct FVector2D GetMouseFlashPosition ( );
	struct FString GetSkinNameFromEnum ( unsigned char TheSkinEnum );
	unsigned char GetSkinEnumFromId ( int SkinId );
	class UTexture* GetAbilitySlotTextureForClass ( unsigned char TheClass, int AbilitySlot );
	struct FString GetAbilitySlotNameForClass ( unsigned char TheClass, int AbilitySlot );
	struct FString GetAbilitySlotNameForAbility ( class ADVAbility* InputAbility );
	bool UsesMana ( unsigned char TheClass );
	class UClass* GetClassClassFromEnum ( unsigned char ThePlayerClass );
	struct FString GetClassStringFromEnum ( unsigned char ThePlayerClass );
	unsigned char GetClassEnumFromString ( struct FString ClassName );
	class ADVAbility* GetAbilityArchetype ( unsigned char OwningClass, unsigned char Slot, unsigned char Focus );
	class ADVPawnHero* GetPawnArchetypeForClass ( unsigned char TheClass );
	int GetMapId ( struct FString MapName );
	int GetGameTypeId ( struct FString GameType );
	struct FString GetSteamId ( struct FUniqueNetId UniqueId );
};

UClass* UForgeDB::pClassPointer = NULL;

// Class ForgeGame.DVSeqAct_SetPawnBlockingChannels
// 0x0004 (0x0100 - 0x00FC)
class UDVSeqAct_SetPawnBlockingChannels : public USequenceAction
{
public:
	struct FBlockingChannelsContainer                  BlockingChannels;                                 		// 0x00FC (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42464 ];

		return pClassPointer;
	};

};

UClass* UDVSeqAct_SetPawnBlockingChannels::pClassPointer = NULL;

// Class ForgeGame.DVBuffCalculator
// 0x001C (0x0058 - 0x003C)
class UDVBuffCalculator : public UObject
{
public:
	TArray< struct FProtectionFromAbility >            ProtectionList;                                   		// 0x003C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FSStatChange >                      StatChanges;                                      		// 0x0048 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class ADVPawn*                                     Pawn;                                             		// 0x0054 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42467 ];

		return pClassPointer;
	};

	void ResetForRoundStart ( );
	void ResetForDeath ( );
	void RemoveExpired ( );
	void CalculateFinalCaps ( unsigned char StatName, float* PreviousValue );
	void CalculatePreLockCaps ( unsigned char StatName, float* PreviousValue );
	float CalculateMaxChanges ( unsigned char TheStat, float EffectiveValue, float BaseValue );
	void CalculateAssignedChanges ( unsigned char TheStat, float* PreviousValue );
	float CalculateAddedChanges ( unsigned char TheStat );
	float CalculateMultipliedChanges ( unsigned char TheStat, float BaseValue );
	float CalculateStat ( unsigned char TheStat, float BaseValue );
	void AddBuff ( class UDVBuff* NewBuff );
	void AddToStatChanges ( struct FSStatChange NewStatChange );
	void Destroyed ( );
};

UClass* UDVBuffCalculator::pClassPointer = NULL;

// Class ForgeGame.DVAbility
// 0x00E8 (0x02B0 - 0x01C8)
class ADVAbility : public AActor
{
public:
	class UDVBuff*                                     GivenBuff;                                        		// 0x01C8 (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	class UDVHealthOverTime*                           HealthOverTime;                                   		// 0x01CC (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	float                                              Cooldown;                                         		// 0x01D0 (0x0004) [0x0000000000000000]              
	float                                              CooldownInterval;                                 		// 0x01D4 (0x0004) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
	float                                              TimeTillReady;                                    		// 0x01D8 (0x0004) [0x0000000000000000]              
	unsigned char                                      Used;                                             		// 0x01DC (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      Refreshed;                                        		// 0x01DD (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      OwningClass;                                      		// 0x01DE (0x0001) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
	unsigned char                                      Slot;                                             		// 0x01DF (0x0001) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
	unsigned char                                      Focus;                                            		// 0x01E0 (0x0001) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
	unsigned char                                      RepStartCast;                                     		// 0x01E1 (0x0001) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      AbilitiesIndex;                                   		// 0x01E2 (0x0001) [0x0000000000000020]              ( CPF_Net )
	float                                              ResourceCost;                                     		// 0x01E4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              CastTime;                                         		// 0x01E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                Range;                                            		// 0x01EC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              Damage;                                           		// 0x01F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UClass*                                      DamageType;                                       		// 0x01F4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      CanMoveWhileCasting : 1;                          		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	unsigned long                                      InterruptImmune : 1;                              		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      FriendlyAbility : 1;                              		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	unsigned long                                      TriggersGCD : 1;                                  		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000008] ( CPF_Edit )
	unsigned long                                      IgnoresGCD : 1;                                   		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000010] ( CPF_Edit )
	unsigned long                                      DoesStacking : 1;                                 		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000020] ( CPF_Edit )
	unsigned long                                      Targeted : 1;                                     		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000040] ( CPF_Edit )
	unsigned long                                      UsedAimAssist : 1;                                		// 0x01F8 (0x0004) [0x0000000000000000] [0x00000080] 
	unsigned long                                      FullBodyAnim : 1;                                 		// 0x01F8 (0x0004) [0x0000000000000001] [0x00000100] ( CPF_Edit )
	unsigned long                                      Locked : 1;                                       		// 0x01F8 (0x0004) [0x0000000000000000] [0x00000200] 
	float                                              Delay;                                            		// 0x01FC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FString                                     AbilityName;                                      		// 0x0200 (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	struct FString                                     FocusName;                                        		// 0x020C (0x000C) [0x0000000000408003]              ( CPF_Edit | CPF_Const | CPF_Localized | CPF_NeedCtorLink )
	class UParticleSystem*                             CastParticle;                                     		// 0x0218 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             FireParticle;                                     		// 0x021C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             HitParticle;                                      		// 0x0220 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UParticleSystem*                             FailureParticle;                                  		// 0x0224 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       CastAnimName;                                     		// 0x0228 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       CastSocket;                                       		// 0x0230 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       FireSocket;                                       		// 0x0238 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       HitSocket;                                        		// 0x0240 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       FailureSocket;                                    		// 0x0248 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       BeamEndPointName;                                 		// 0x0250 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FSAttachmentAnimation >             AttachmentAnimations;                             		// 0x0258 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	class USoundCue*                                   CastingSound;                                     		// 0x0264 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   FireSound;                                        		// 0x0268 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   HitSound;                                         		// 0x026C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class USoundCue*                                   FailureSound;                                     		// 0x0270 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class ADVPawn*                                     CastingPawn;                                      		// 0x0274 (0x0004) [0x0000000000000000]              
	class ADVPawn*                                     TargetPawn;                                       		// 0x0278 (0x0004) [0x0000000000000000]              
	TArray< class ADVPawn* >                           ModifiedAttackers;                                		// 0x027C (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class ADVPawn* >                           ModifiedDefenders;                                		// 0x0288 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class UDVHealthOverTime* >                 ActiveHots;                                       		// 0x0294 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                HotTickTime;                                      		// 0x02A0 (0x0004) [0x0000000000000000]              
	class UDVAttack*                                   Attack;                                           		// 0x02A4 (0x0004) [0x0000000000000000]              
	class UParticleSystemComponent*                    ParticleEmitter;                                  		// 0x02A8 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystem*                             GenericHit;                                       		// 0x02AC (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42501 ];

		return pClassPointer;
	};

	void eventDestroyed ( );
	struct FString GetDescriptionNumbers ( class ADVAbility* AbilityArchetype, unsigned char TheClass, struct FString StaticFriendlyColor, struct FString StaticEnemyColor );
	struct FString GetFullDescription ( class ADVAbility* AbilityArchetype, unsigned char TheClass );
	void KillPartcleEmitter ( );
	void AddParticleEmitter ( class APawn* Hero );
	class UDVAttack* MakeAttack ( );
	class UDVAttack* SpawnAttack ( );
	void HotTick ( );
	void SendHot ( class ADVPawn* HotTarget );
	void Reset ( );
	void UnRegisterWithAllDefendingPawns ( );
	void UnRegisterWithDefendingPawn ( class ADVPawn* Modifier );
	void RegisterWithDefendingPawn ( class ADVPawn* Modifier );
	void ModifyDefense ( class UDVAttack* IncomingAttack, class ADVPawn* Defender, TArray< struct FSDamage >* DamageTaken, int* ProtectionDone );
	void UnRegisterWithAllAttackingPawns ( );
	void UnRegisterWithAttackingPawn ( class ADVPawn* Modifier );
	void RegisterWithAttackingPawn ( class ADVPawn* Modifier );
	void ModifyAttack ( class UDVAttack* OutGoingAttack );
	bool IsStillInLOS ( class ADVPawn* TargetActor );
	void GoOnCooldown ( unsigned long UseResource );
	bool Interrupt ( unsigned long SelfInterrupt );
	void LogStartCast ( );
	void FireAbility ( );
	void PerformAbility ( );
	bool Activate ( class ADVPawn* RepTargetPawn, unsigned long RepUsingAimAssist );
	bool ReadyToActivate ( );
	bool IsAbilityReady ( );
	void Tick ( float DeltaTime );
	void SetAbilitiesIndex ( int NewAbilitiesIndex );
	void PlayFailureEffect ( );
	void PlayHitEffect ( class ADVPawn* RepHitPawn );
	void PlayFireEffect ( class ADVPawn* RepHitPawn );
	void PlayAnim ( );
	void PlayCastEffect ( );
	struct FString GetAbilityDescription ( );
	struct FString GetAbilityName ( );
	struct FString GetAbilityLocalizationPath ( unsigned char TheOwningClass, struct FString TheAbilityName, unsigned char TheFocus );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ADVAbility::pClassPointer = NULL;

// Class ForgeGame.DVBuff
// 0x0010 (0x004C - 0x003C)
class UDVBuff : public UObject
{
public:
	TArray< struct FSStatChange >                      StatChanges;                                      		// 0x003C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	class ADVAbility*                                  Ability;                                          		// 0x0048 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42530 ];

		return pClassPointer;
	};

};

UClass* UDVBuff::pClassPointer = NULL;

// Class ForgeGame.DVPawn
// 0x01A8 (0x0604 - 0x045C)
class ADVPawn : public ADVPawnBase
{
public:
	TArray< struct ADVPawn_FSAttachment >              Attachments;                                      		// 0x045C (0x000C) [0x0000000000400001]              ( CPF_Edit | CPF_NeedCtorLink )
	TArray< struct FSGenericOverrideInteraction >      FootstepInteractionOverrides;                     		// 0x0468 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FName >                             UnfixedBodyNames;                                 		// 0x0474 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FName >                             EnabledSpringBodyNames;                           		// 0x0480 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FName >                             HitReactionBones;                                 		// 0x048C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	float                                              LinearBoneSpringStrength;                         		// 0x0498 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              AngularBoneSpringStrength;                        		// 0x049C (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              ImpulseForce;                                     		// 0x04A0 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              PhysicsBlendInTime;                               		// 0x04A4 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              PhysicsTime;                                      		// 0x04A8 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              PhysicsBlendOutTime;                              		// 0x04AC (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< struct FName >                             HitSocketNames;                                   		// 0x04B0 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	float                                              PhysicsWeight;                                    		// 0x04BC (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              PhysicsCD;                                        		// 0x04C0 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	float                                              LastPhysicsTime;                                  		// 0x04C4 (0x0004) [0x0000000000000000]              
	class UDVBuffCalculator*                           BuffCalc;                                         		// 0x04C8 (0x0004) [0x0000000000000000]              
	class UDynamicLightEnvironmentComponent*           LightEnvironment;                                 		// 0x04CC (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	float                                              HealthPoints;                                     		// 0x04D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              HealthPointsMax;                                  		// 0x04D4 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              HealthPointsMaxBase;                              		// 0x04D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              HealthPointsRegen;                                		// 0x04DC (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              HealthPointsRegenBase;                            		// 0x04E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ArmorPhysical;                                    		// 0x04E4 (0x0004) [0x0000000000000000]              
	int                                                ArmorPhysicalBase;                                		// 0x04E8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ArmorNature;                                      		// 0x04EC (0x0004) [0x0000000000000000]              
	int                                                ArmorNatureBase;                                  		// 0x04F0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ArmorSpiritual;                                   		// 0x04F4 (0x0004) [0x0000000000000000]              
	int                                                ArmorSpiritualBase;                               		// 0x04F8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                ArmorMagic;                                       		// 0x04FC (0x0004) [0x0000000000000000]              
	int                                                ArmorMagicBase;                                   		// 0x0500 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              JumpAccelRate;                                    		// 0x0504 (0x0004) [0x0000000000000021]              ( CPF_Edit | CPF_Net )
	float                                              MoveSpeed;                                        		// 0x0508 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              MoveSpeedBase;                                    		// 0x050C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              DamageMultiplier;                                 		// 0x0510 (0x0004) [0x0000000000000000]              
	float                                              InboundDamageMultiplier;                          		// 0x0514 (0x0004) [0x0000000000000000]              
	float                                              DamageMirror;                                     		// 0x0518 (0x0004) [0x0000000000000000]              
	float                                              DamageMirrorBase;                                 		// 0x051C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              GCDIntervalBase;                                  		// 0x0520 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class ADVAbility*                                  CastingSpell;                                     		// 0x0524 (0x0004) [0x0000000000000020]              ( CPF_Net )
	TArray< class ADVAbility* >                        AttackModifiers;                                  		// 0x0528 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< class ADVAbility* >                        DefenseModifiers;                                 		// 0x0534 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	int                                                Disoriented;                                      		// 0x0540 (0x0004) [0x0000000000000000]              
	float                                              DisorientedDecayRate;                             		// 0x0544 (0x0004) [0x0000000000000000]              
	float                                              Gravity;                                          		// 0x0548 (0x0004) [0x0000000000000000]              
	class AForgeGameInfo*                              ForgeGame;                                        		// 0x054C (0x0004) [0x0000000000000000]              
	struct FName                                       FullBodyAnimSlotName;                             		// 0x0550 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       UpperBodyAnimSlotName;                            		// 0x0558 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       LeftFootSocketName;                               		// 0x0560 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       RightFootSocketName;                              		// 0x0568 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                JumpCost;                                         		// 0x0570 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MaxHealsPerSecond;                                		// 0x0574 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	TArray< struct FSHealRecord >                      HealCounter;                                      		// 0x0578 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	class UAnimNodeSlot*                               FullBodyAnimSlot;                                 		// 0x0584 (0x0004) [0x0000000000000000]              
	class UAnimNodeSlot*                               UpperBodyAnimSlot;                                		// 0x0588 (0x0004) [0x0000000000000000]              
	struct FName                                       DeathAnimName;                                    		// 0x058C (0x0008) [0x0000000000000001]              ( CPF_Edit )
	struct FName                                       HitAnimName;                                      		// 0x0594 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                HeadIconsHeight;                                  		// 0x059C (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UCameraShake*                                CameraShake;                                      		// 0x05A0 (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	class UCameraShake*                                CameraShakeHitPlayer;                             		// 0x05A4 (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	class ULightComponent*                             Light;                                            		// 0x05A8 (0x0004) [0x000000000408000B]              ( CPF_Edit | CPF_Const | CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UParticleSystem*                             MedalParticle;                                    		// 0x05AC (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class UMaterialEffect*                             PPMaterial;                                       		// 0x05B0 (0x0004) [0x0000000000000000]              
	class UParticleSystemComponent*                    ParticleEmitter;                                  		// 0x05B4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	class UPhysicalMaterial*                           DefaultPhysicalMaterial;                          		// 0x05B8 (0x0004) [0x0000000000000002]              ( CPF_Const )
	struct FSHitReaction                               HitReactionInfo;                                  		// 0x05BC (0x0010) [0x0000000000000020]              ( CPF_Net )
	unsigned long                                      CanCast : 1;                                      		// 0x05CC (0x0004) [0x0000000000000020] [0x00000001] ( CPF_Net )
	unsigned long                                      ResourceIsMana : 1;                               		// 0x05CC (0x0004) [0x0000000000000001] [0x00000002] ( CPF_Edit )
	unsigned long                                      MeleeClass : 1;                                   		// 0x05CC (0x0004) [0x0000000000000001] [0x00000004] ( CPF_Edit )
	float                                              Resource;                                         		// 0x05D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ResourceMax;                                      		// 0x05D4 (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              ResourceMaxBase;                                  		// 0x05D8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              ResourceRegen;                                    		// 0x05DC (0x0004) [0x0000000000000020]              ( CPF_Net )
	float                                              ResourceRegenBase;                                		// 0x05E0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	float                                              TimeOutOfLoS;                                     		// 0x05E4 (0x0004) [0x0000000000000000]              
	float                                              LocalDistance;                                    		// 0x05E8 (0x0004) [0x0000000000000000]              
	int                                                LastVelocitySq;                                   		// 0x05EC (0x0004) [0x0000000000000000]              
	struct FSSyncResource                              SyncResource;                                     		// 0x05F0 (0x0004) [0x0000000000000020]              ( CPF_Net )
	class ADVAbilityMoltenCage*                        MoltenCage;                                       		// 0x05F4 (0x0004) [0x0000000000000000]              
	TArray< class ADVAbilitySpirtualFervor* >          FervorStacks;                                     		// 0x05F8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42540 ];

		return pClassPointer;
	};

	void eventBaseChange ( );
	void TossPawn ( struct FVector Knockback );
	void eventPlayFootStepSound ( int FootDown );
	void AddVelocity ( struct FVector NewVelocity, struct FVector HitLocation, class UClass* DamageType, struct FTraceHitInfo HitInfo );
	void RemoveDisoriented ( int Decrease );
	void AddDisoriented ( int Increase );
	void TakeFallingDamage ( );
	void GiveBuff ( class UDVBuff* GivenBuff );
	float ArmorDiminish ( int ArmorValue, float Scale );
	int GetArmorForType ( class UClass* Type, unsigned long BaseArmor );
	float ReduceDamage ( struct FSDamage NewDamage );
	void StartRagdoll ( );
	void StopRagdoll ( );
	void SetRagdollAnimation ( );
	void PlayDying ( class UClass* DamageType, struct FVector HitLoc );
	bool Died ( class AController* Killer, class UClass* DamageType, struct FVector HitLocation );
	void NotifyHealthChange ( class ADVPlayerController* Attacker, float HealthChange );
	void SimulatedPhysicsBlendOut ( );
	void SimulatingPhysics ( );
	void SimulatingPhysicsBlendIn ( );
	void BlendInPhysics ( );
	void PlayHitReaction ( struct FVector AttackImpulse );
	void ClientTargetHit ( class ADVPawn* EnemyHit, unsigned long IsHeal, unsigned long ExactlyTargetted );
	bool AttackMisses ( class UDVLogEntry* LogEntry, class UDVAttack** Attack );
	bool CheckSmokeMiss ( struct FVector AttackOrigin );
	void CapHealing ( float* TotalDamageDone );
	void NotifyKismetOfAttackResult ( class ADVPawn* TheAttacker, class ADVPawn* TheTarget, unsigned char TheResult );
	void TakeAttack ( class UDVAttack** Attack );
	void TakeEnvironmentalDamage ( float TotalDamageDone, unsigned long CreditLastHitBy );
	void Suicide ( );
	void eventTakeDamage ( int Damage, class AController* InstigatedBy, struct FVector HitLocation, struct FVector Momentum, class UClass* DamageType, struct FTraceHitInfo HitInfo, class AActor* DamageCauser );
	void DoRegens ( );
	void eventTick ( float DeltaTime );
	bool DoJump ( unsigned long bUpdating );
	void PossessedBy ( class AController* C, unsigned long bVehicleTransition );
	void MatchStarting ( );
	bool IsPawnReady ( );
	bool StopsProjectile ( class AProjectile* P );
	void InitiateStats ( );
	bool ShouldDisplayOnHud ( );
	void PostBeginPlay ( );
	void RemoveResource ( float Amount );
	void ResetCollision ( );
	void eventStuckOnPawn ( class APawn* OtherPawn );
	void eventEncroachedBy ( class AActor* Other );
	void PlayGetMedal ( );
	void eventPostInitAnimTree ( class USkeletalMeshComponent* SkelComp );
	void eventDestroyed ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ADVPawn::pClassPointer = NULL;

// Class ForgeGame.DVSeqEvent_AttackResult
// 0x0003 (0x0117 - 0x0114)
class UDVSeqEvent_AttackResult : public USequenceEvent
{
public:
	unsigned char                                      AttackAggressor;                                  		// 0x0114 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      AttackTarget;                                     		// 0x0115 (0x0001) [0x0000000000000001]              ( CPF_Edit )
	unsigned char                                      AttackResult;                                     		// 0x0116 (0x0001) [0x0000000000000001]              ( CPF_Edit )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42542 ];

		return pClassPointer;
	};

};

UClass* UDVSeqEvent_AttackResult::pClassPointer = NULL;

// Class ForgeGame.DVPhysicalMaterialProperties
// 0x0028 (0x0064 - 0x003C)
class UDVPhysicalMaterialProperties : public UPhysicalMaterialPropertyBase
{
public:
	unsigned char                                      SurfaceType;                                      		// 0x003C (0x0001) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	TArray< struct FSGenericInteraction >              FootstepInteractions;                             		// 0x0040 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FSGenericInteraction >              JumpingInteractions;                              		// 0x004C (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )
	TArray< struct FSGenericInteraction >              LandingInteractions;                              		// 0x0058 (0x000C) [0x0000000000400003]              ( CPF_Edit | CPF_Const | CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42549 ];

		return pClassPointer;
	};

	void InstanceInteraction ( struct FSGenericInteraction GenericInteraction, struct FVector Location, unsigned long UseOverrideRotation, struct FRotator OverrideRotation, class USkeletalMeshComponent* SkeletalMeshToAttachTo, TArray< struct FName > AttachmentSocketNames, unsigned long SkipIfDedicatedServer );
};

UClass* UDVPhysicalMaterialProperties::pClassPointer = NULL;

// Class ForgeGame.DVAbilitySpirtualFervor
// 0x0024 (0x02D4 - 0x02B0)
class ADVAbilitySpirtualFervor : public ADVAbility
{
public:
	float                                              TickTimer;                                        		// 0x02B0 (0x0004) [0x0000000000000000]              
	float                                              Duration;                                         		// 0x02B4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                MaxNumberOfStack;                                 		// 0x02B8 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	class ADVPawn*                                     RepHitPawn;                                       		// 0x02BC (0x0004) [0x0000000000000020]              ( CPF_Net )
	unsigned char                                      AttackFailed;                                     		// 0x02C0 (0x0001) [0x0000000000000020]              ( CPF_Net )
	class UAudioComponent*                             HitSoundComponent;                                		// 0x02C4 (0x0004) [0x0000000004080008]              ( CPF_ExportObject | CPF_Component | CPF_EditInline )
	TArray< struct FFervorStack >                      FervorStacks;                                     		// 0x02C8 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42627 ];

		return pClassPointer;
	};

	void eventDestroyed ( );
	void Reset ( );
	void ClientRemoveAllStacks ( class ADVPlayerReplicationInfo* PRI );
	void ClientRemoveStack ( class ADVPlayerReplicationInfo* PRI );
	void ClientAddStack ( class ADVPlayerReplicationInfo* PRI );
	int RemoveAllStacks ( class ADVPawn* Pawn );
	bool RemoveStack ( class ADVPawn* Pawn );
	void UpdateStacks ( );
	void UpdateBeamEmitter ( struct FVector EndLocation );
	void Tick ( float DeltaTime );
	void StopAbility ( );
	bool Interrupt ( unsigned long SelfInterrupt );
	void FireAbility ( );
	void PerformAbility ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ADVAbilitySpirtualFervor::pClassPointer = NULL;

// Class ForgeGame.DVAttachment
// 0x0004 (0x01CC - 0x01C8)
class ADVAttachment : public AActor
{
public:
	unsigned long                                      DetachOnDeath : 1;                                		// 0x01C8 (0x0004) [0x0000000000000003] [0x00000001] ( CPF_Edit | CPF_Const )
	unsigned long                                      UsePostAsyncWorkTickGroup : 1;                    		// 0x01C8 (0x0004) [0x0000000000000003] [0x00000002] ( CPF_Edit | CPF_Const )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42629 ];

		return pClassPointer;
	};

	void ForceMipLevels ( );
	void ToggleHidden ( unsigned long ShouldHide );
	void NotifyOwnerDied ( class APawn* Pawn, struct FName SocketName );
	void PlayDetermined ( unsigned long Determined );
	void SetStealth ( unsigned long IsStealthed, unsigned long IsCamouflaged );
	void AttachToSocketOnSkeletalMeshComponent ( class USkeletalMeshComponent* BaseSkeletalMeshComponent, struct FName SocketName );
	void AttachToSocket ( class ADVPawn* DVPawn, struct FName SocketName );
	class UPrimitiveComponent* GetComponent ( );
	void PostBeginPlay ( );
};

UClass* ADVAttachment::pClassPointer = NULL;

// Class ForgeGame.DVAbilityProjectile
// 0x002C (0x02DC - 0x02B0)
class ADVAbilityProjectile : public ADVAbility
{
public:
	class ADVProjectile*                               DVProjectileArchetype;                            		// 0x02B0 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	class ADVProjectile*                               DVProjectileArchetypeShadow;                      		// 0x02B4 (0x0004) [0x0000000000000003]              ( CPF_Edit | CPF_Const )
	struct FName                                       ProjectileSocket;                                 		// 0x02B8 (0x0008) [0x0000000000000001]              ( CPF_Edit )
	int                                                Knockback;                                        		// 0x02C0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	int                                                IncDisorientation;                                		// 0x02C4 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	unsigned long                                      UseReplicatedEffect : 1;                          		// 0x02C8 (0x0004) [0x0000000000000001] [0x00000001] ( CPF_Edit )
	int                                                TeamNumber;                                       		// 0x02CC (0x0004) [0x0000000000000000]              
	float                                              FromBehindExtraDamage;                            		// 0x02D0 (0x0004) [0x0000000000000001]              ( CPF_Edit )
	struct ADVAbilityProjectile_FSHitPawn              RepHitPawn;                                       		// 0x02D4 (0x0008) [0x0000000000000020]              ( CPF_Net )

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42637 ];

		return pClassPointer;
	};

	void ProjectileHit ( class ADVPawn* HitPawn, struct FVector HitLocation, struct FVector HitNormal, class ADVProjectile* Projectile );
	class ADVProjectile* SpawnProjectile ( );
	void FireAbility ( );
	void eventReplicatedEvent ( struct FName VarName );
};

UClass* ADVAbilityProjectile::pClassPointer = NULL;

// Class ForgeGame.DVAbilityMoltenCage
// 0x0008 (0x02E4 - 0x02DC)
class ADVAbilityMoltenCage : public ADVAbilityProjectile
{
public:
	class UDVBuff*                                     LongStun;                                         		// 0x02DC (0x0004) [0x0000000004000001]              ( CPF_Edit | CPF_EditInline )
	class UDVAttack*                                   LongStunAttack;                                   		// 0x02E0 (0x0004) [0x0000000000000000]              

private:
	static UClass* pClassPointer;

public:
	static UClass* StaticClass()
	{
		if ( ! pClassPointer )
			pClassPointer = (UClass*) UObject::GObjObjects()->Data[ 42636 ];

		return pClassPointer;
	};

	void eventDestroyed ( );
	void HitsActor ( class ADVPawn* HitPawn, class AActor* Other );
	void FireAbility ( );
	void ProjectileHit ( class ADVPawn* HitPawn, struct FVector HitLocation, struct FVector HitNormal, class ADVProjectile* Projectile );
};

UClass* ADVAbilityMoltenCage::pClassPointer = NULL;

// Class ForgeGame.ForgeGameInfo
// 0x0168 (0x0500 - 0x0398)
class AForgeGameInfo : public AForgeGameInfoBase
{
public:
	float                                              GameLength;                                       		// 0x0398 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              WarmupLength;                                     		// 0x039C (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              DeathTimerLength;                                 		// 0x03A0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              ScoreDisplayLength;                               		// 0x03A4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned char                                      RoundsPerMap;                                     		// 0x03A8 (0x0001) [0x0000000000004000]              ( CPF_Config )
	float                                              AutoBalanceTriggerTime;                           		// 0x03AC (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              AutoBalanceWarningTime;                           		// 0x03B0 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              AutoBalanceFinalWarningTime;                      		// 0x03B4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              LastAutoBalanceTrigger;                           		// 0x03B8 (0x0004) [0x0000000000000000]              
	float                                              LastAutoBalanceWarning;                           		// 0x03BC (0x0004) [0x0000000000000000]              
	float                                              LastAutoBalanceFinalWarning;                      		// 0x03C0 (0x0004) [0x0000000000000000]              
	float                                              EndGameNoAutoBalancePeriod;                       		// 0x03C4 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              AssistPeriod;                                     		// 0x03C8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              HelpRequestPeriod;                                		// 0x03CC (0x0004) [0x0000000000004000]              ( CPF_Config )
	unsigned long                                      IsGameTypeSetupDone : 1;                          		// 0x03D0 (0x0004) [0x0000000000000000] [0x00000001] 
	unsigned long                                      Random : 1;                                       		// 0x03D0 (0x0004) [0x0000000000044000] [0x00000002] ( CPF_Config | CPF_GlobalConfig )
	TArray< class UDVLogEntry* >                       CombatLog;                                        		// 0x03D4 (0x000C) [0x0000000000400000]              ( CPF_NeedCtorLink )
	TArray< struct FString >                           RotationMaps;                                     		// 0x03E0 (0x000C) [0x0000000000404000]              ( CPF_Config | CPF_NeedCtorLink )
	TArray< struct FString >                           RandomGameModes;                                  		// 0x03EC (0x000C) [0x0000000000444000]              ( CPF_Config | CPF_GlobalConfig | CPF_NeedCtorLink )
	float                                              TowerActivePeriod;                                		// 0x03F8 (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              TowerWarningPeriod;                               		// 0x03FC (0x0004) [0x0000000000004000]              ( CPF_Config )
	float                                              LastTowerActiveSwitchTime;                        		// 0x0400 (0x0004) [0x0000000000000000]              
	class ADVTower*                                    LastActiveTower;                                  		// 0x0404 (0x0004) [0x0000000000000000]              
	float                                              LastTimeServerEmptied;                            		// 0x0408 (0x0004) [0x0000000000000000]              
	float                                              MaxLastTimeServerEmptied;                         		// 0x040C (0x0004) [0x0000000000000002]              ( CPF_Const )
	int                                                JoinedPlayersThisTick;                            		// 0x0410 (0x0004) [0x0000000000000000]              
	int                                                Tier1MedalXP;                                     		// 0x0414 (0x0004) [0x0000000000004000]              ( CPF_Config )
	int                                                Tier2MedalXP;                                     		// 0x0418 (0x0004) [0x0000000000004000]              ( CPF_Config )
